## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/cc998f5d-8874-425a-819f-ef9a48939ee4).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpynibc4yz/plan`

```diff
2024-12-02T21:28:14.340Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:28:14.340Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:28:14.340Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:28:14.340Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:28:14.340Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:28:14.340Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:28:14.340Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpynibc4yz/plan"}
2024-12-02T21:28:14.340Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:28:14.340Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:28:14.340Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:28:14.340Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:28:14.340Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:28:14.340Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:28:14.340Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:28:14.341Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:28:14.341Z [INFO]  CLI command args: []string{"show", "/tmp/tmpynibc4yz/plan"}
2024-12-02T21:28:14.433Z [DEBUG] checking for provisioner in "."
2024-12-02T21:28:14.433Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:28:14.433Z [DEBUG] created provider logger: level=debug
2024-12-02T21:28:14.433Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:28:14.447Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:28:14.447Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=798
2024-12-02T21:28:14.447Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:28:14.457Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:28:14.457Z
2024-12-02T21:28:14.471Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1589940701 network=unix timestamp=2024-12-02T21:28:14.471Z
2024-12-02T21:28:14.471Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:28:14.507Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:28:14.509Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=798
2024-12-02T21:28:14.509Z [DEBUG] provider: plugin exited
2024-12-02T21:28:14.509Z [DEBUG] created provider logger: level=debug
2024-12-02T21:28:14.509Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:28:14.515Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:28:14.515Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=807
2024-12-02T21:28:14.515Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:28:14.518Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:28:14.518Z
2024-12-02T21:28:14.533Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin376747758 network=unix timestamp=2024-12-02T21:28:14.533Z
2024-12-02T21:28:14.533Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:28:14.544Z [DEBUG] No provider meta schema returned
2024-12-02T21:28:14.545Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:28:14.546Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=807
2024-12-02T21:28:14.546Z [DEBUG] provider: plugin exited
2024-12-02T21:28:14.546Z [DEBUG] created provider logger: level=debug
2024-12-02T21:28:14.546Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:28:14.551Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:28:14.551Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=816
2024-12-02T21:28:14.551Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:28:14.601Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:28:14.600Z
2024-12-02T21:28:14.620Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:28:14.620Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin2520172412 network=unix timestamp=2024-12-02T21:28:14.619Z
2024-12-02T21:28:14.638Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94VklWf_\xf6\xf5\xfa\xb1\xc7k{}\xbc~\x8d\xaf\xedt\xbd\x89g\xbc\xe3Gb\x9a\x84\xa4nEDIe\xe1!\xaaʝ\xcc^\xafG\x9e\x9dY\xcd̮\xe3\xa06H\x90 \x89\x9fA\xa4\xe2\x91\x94ʡ(
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: Q)$
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x95
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: R\xf3\xa3\x8dp\x90\x8a\xee\x9d}\xb9\xd9:i\xa48\x9b\xfb}\xe7\xfb\xce9\xf7ܳ>\xf6\xfd\xcf_y\xf5\xec\xf9\xd7_\xc2h\x98 \x93\x84\xef\xff\xf9s/~V||q\xf30\xc0W^\xfeE\x88FH \xfe\xd1\x814!\x88`Dj\xa2	\xc4\xdb\xd7n\x86h\x98\xc1\xa1\x82w\x82\x84fl\x96H\x9a\x90\xb4`\x8b\xa5@Bx\xe1\xeeM\xae\x863A\xc1
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: C+\xb6
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: ,\x8c/]\xf95\xc7"\xf0\xf5\x80\xc0"ІmR;\xc1+o\xdf\xe2X\xfc܏k\x82\xec\x90b4A\x9a\xf0\xdc[\xb7\xb83t\xd3!\xf0\x9f\xd1\x80 u\xa6	!Ǹ\xa3@\x9a\xf1\xec\xbbB\xa7\xfe\xe6\xb3Z\xa0\xbbF\xf0G\xdf}\x93{D\xe1\xef~\x8dQ\xe8\xc6n\xa9\x87i\xc1\xad\xed\xbbk\x85\xebm"\xb7VH`B\xea\xa11\xc5\xb7\xcfFh\x98\xb4AF@mЋ\xbdR \xadxy\xeb\x95\x8d\x90v\xb8\xe8۵C\xf6II
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4\xf9\xed\xf3\xeb\x80\xd7|\xac\xfa\xb1_\xa0@\xda\xf1\xb5\xab[\x8b\xc1\xab~+b0\x88\x83\xd2\x8d\x91<q\x8b\xdb\x94\x84\xc00(\x86o^\xb8\xd7Nä\xe2\xea	%i\x84\xbcx\xeb\xcbA!q\xd8\xf6\xe3@\x91J\xa3\xf1> \xbf\xe5(\x82\xa1p\xa4\xa9\x99\xb4D[\xdb\xda;b@\x81t❛7x\xdd\xf8i 4A\xe2\xf8\xbfK7y\xb7\xfd\xdb\xee\x82\xbe\\x8cᘸ\xc7.\xfcS县\x84 \x8d\x91n\xfc\xd6\xef\xde\xe01\xddPyu\xc38\x8eK{h\x82\xf4\xe0\xd5\xd3\xdb\xea\x81Q!	\xf8\x8bߋx\x9f\x90\xf6\xa4	I@
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: S\xd2\x92\xc0/\xde\xff/O\xa6\xce\xf9\xac^HcZ`\xbd\xf8\xa0\xd2i\xde\xcdx\xa2RU{g\xbc+\xdcݓ譔\x84\xf8\xfa\xe5\xf2(\xa9U\x94ԇ/_\xad+)wy\xa9@\x92\xf8\xefJ!\xdf\xe3\x85 \xe9\xc7\xd3?#\x8a\xf0\xbfl\x84\xbd\xb8W\x8c\xe8 ~\xe3\x9e\xad&\xb8\xc1\xd912\x88\xdc\xfe'\xaf\xadE\xd9}\xb0\xf7I\x93\xc8~\xe1\xf6}^J\xae\xf9\xb3\x96eI\xa112\x8c\x97~\xff.\xeb\x87O\x88\xb0~\x98\xc2)I\xf8\xc3s\xefph \xe64 \xccH*2\x82\xbf\xfa\xd9\xb8\xe2 l\xb5
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: l\xa6qZ\x9a\xa1\x83\x84\xe2\xd7ξ\xa62\xa24B\x86\xe1\xad(	\\xe0OyfqV\x9aI2s8'>I\xb0\xf7K(\x90Q\xbc|m\x9b\x8f\xc0W\xfd\x9aG`祏R c\xf8\x93;\xdf\xe4sJ\xe1\x81_\x85'\xf1I\xe9 2\x8e\x97\xfe \xb0Q\xf8\x8d\x8f\x8d\xc2!<$\xb0=x\xfd\xb7\xab\x94?\x87\xf1\xb0t0\x9e\xac\xdc['\xf6%\xfb\x9a\x9a\x87\x86\xa5::6\xbe'	$ \x9b\x9b\x9bAܼv\xaf=\xf5\xb1\x81d7	\xc2\xe6\x99\xbd}\xfd\xbda\xdc\xfc\xab\xf87u$\x99$!\xce{\xf0\xff\xc0\xcd3\x95\x8f\xa9\xa3\xeaG\xd4fW\xcbL\xe6\xaa\xdd.Z\x9e\xd2E\xb5\xd5\xd2,\xdbe\xbame]u\w6
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9e\xad0\xd34
2024-12-02T21:28:14.802Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9e\xa1+\x86\xe51\xc7\xd2Le\xc5\xd0<\xb90\xabf\x8eMu\x9f\xbeM)̪\x99e07#\xe7luJߍ-\xa7ҋ\xb3j\xe6\x93\xe5\x99\xe5M\xc8\\xf74\x84>\x9e\xfe@a\xcbp=\xa6\x97\xa5m\x83?mO\x9aL}\xe2AU\xf5\xfd\x8f \xeeT_\xd25Ss\x8eMOM\xbd/P\xe6\xfdX(:%Vf=\xa5\xb9L0{\xdfǬz'+\x80\x9eu5\xb9\xc4ce\xe3\xe3\xccb\x8e\xa1\xab=\xf5\x98\xe23r\xb6\xdaU\Q\xfb\xeb}\xee\xb2ekn\xfe\xe1\x88O\x93ZJ\xc2\xd9?<\xba\xf4\\xa6\x9aҩ٩yY_e\xfaڒ\x91\xb34\xaf谪7\xc7\xc4.?X\xf6\xe6\x87\xf2\x82\xc34\x8f-0\xc73V]\xf3\x98\xba7gx\xabœ\xb2n\xe7\x95U\xcd]5t\xdb)(9{\xb2`s\x86%\xe7\x98\xc5͏Q'w')e\xe4yF\xc9{\xa6˭\xc7v\xa7\xcbK\xcc)1UٝUu9\xd9\xe1\xb2O5\xf0\x98\xe3h+\xb6\x93/g>\x99\xb3o\xa5\xe0؞]\x9aU\xbc\x95ٲ\x80oz\xfcq5\x8e\x94\xa6\xe4y9\xd3H\xeaç\xe4fה\x92\xaa\xfc\xd6Vs\xf2Sz\xfa\xf1R\xf25\x8e\x94T9\xb3_\x9e*k\xf9\xa9\xf0\xe6\xcc\x95rt\xb9'-yͰd\xfeC\x95\xea\xba\xe9\xd8%#˜ImMsWs\x9f6\xa7hyF\x9e\xf9\xfcX\xf9J\xc1\xb1u\xf0\xb2i\xb4\x8ef\xb3;素9.{fa\xd11J\x9aǞe;g\xdbe\xba\xd8<;f{\xf1\xa1\x98\xca\xf3\xe5\xe3(\xeb\xf4:\xcb\xcf\xc23]\xfe\x97眨ɟ\x99\x9d\x9a\x96m,j\x86\xa3\x8e\x95\xcf+\xdb\xf8\xa1E"\x96\xc8h\x99\xc5\xcd\xfcMqL\xb3\xb2\xc6j/4^#)Z\xd1[\x95s\xb6z\xa8v&\xa7\xd2\xfe\x94\xd6B=\xcdc'>\xb9\x94\x99\x9e\x90\xa6eL\x83Y^\xfd\xaed\xc7Y\xad8.\xfb2˞\xe9f\xa6\xb9I\xe6qM\xaa*\xdd\xb2`[ք\xec\xcbV\xb3S\x87j\x9c\x87̹m}SRe\x8d\xaaÂmy씷\xa3)\xbam\x89\xf1jX\xb5\xad\xd4ܫ\xeaU\x92z8g\xdb9\x93?
2024-12-02T21:28:14.805Z [DEBUG] provider.terraform-provider-akash_v0.1.1: S\xb3r\xb2\xed䔜S\xd0\xddaYfy\x86f\xf2(\xcft\x96u'\xfcGPW[\xa6q\xbc\xd8G\xe4\xa9z\xde|^\xee\xc1\xc6!\xb5\xafo\xcf\xd1,\xb7`;\x9e\xfc[\xcf\xde9Q9R\x8f6\x8e\xae\x95_\xaa*ʪ\xe7\xd4\xf2e\xf3\xd4\xc6r*\xed\x9bM\xc8[?v\xe2ĢZ\xb3M5\x8e\xa9\xda\xfaw\xce\xd5\xe5\xc6\xcc:u~\xb7&\xfb\x94\xb6\xce\xc7E\xdd\xf7H\xbe\xc8J^)Z\xfa\xb4z:P\xfe&P\xd6mg\xcd-h:SLm\x839\xae\xa2\xdbS\xe4\xeaN\xe2[F\xec$WqX\xcep=g\xa3ʆ\xad\x98\xc5<[g'eM\xc99\xa3\x98\x86U<\xb5\xac\xe5\xb3s3\xf5\xdf;\xb6\xdbrIpզ\xe7KY\xd7~A\x8d>_r7\]3\xcd\xfe  \xff\xffa#\xa9  
2024-12-02T21:28:14.805Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=816
2024-12-02T21:28:14.805Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
